<%@ page pageEncoding="UTF-8" %>

<h2>다운로드 테스트 </h2>
<div><a href="/data/a.exe" >자료 1</a></div>
<div><a href="/data/b.jpg" >자료 2</a></div>
<div><a href="/data/c.jsp" >자료 3</a></div>

<!--
    cdn : contents delivery network
    지리적, 물리적으로 떨어져 있는 사용자에게, 컨텐츠를 빠르게 제공하기 위해 구축하는 기술
    느린 응답속도를 극복하고 빠른 다운로드 속도를 제공
    더불어 서버 보안기능 개선 및 강화됨

    ex) 최신 콘솔게임 다운로드시

    브라우져에서 파일을 다운로드 하려고 할 때 일어나는 현상
    브라우져가 처리 가능한 파일 (이미지, 동영상) : 브라우져 내에서 바로 실행
    이미지 : 표시, 동영상,음악 : 재생

    브라우져가 처리 불가능한 파일 : 다운로드
    실행파일, 압축파일 : 다운로드 처리
-->